chipskiller/ahrs_test/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/GD32F3x0_Firmware_Library_V2.6.0/Template/main.c
  // 三份数据在同页内，合并为一次擦写（避免后续 flash_write
  // 擦除整页破坏前面数据）
  fmc_unlock();
  fmc_page_erase(FLASH_ZONE_A);
  fmc_word_program(FLASH_ZONE_A, ((uint32_t *)&att)[0]);
  fmc_word_program(FLASH_ZONE_A + 4, ((uint32_t *)&att)[1]);
  fmc_word_program(FLASH_ZONE_A + 8, ((uint32_t *)&att)[2]);
  fmc_word_program(FLASH_ZONE_A + 12, ((uint32_t *)&att)[3]);
  fmc_word_program(FLASH_ZONE_A + 16, ((uint32_t *)&att)[4]);
  fmc_word_program(FLASH_ZONE_A + 20, ((uint32_t *)&att)[5]);
  fmc_word_program(FLASH_ZONE_B, ((uint32_t *)&att)[0]);
  fmc_word_program(FLASH_ZONE_B + 4, ((uint32_t *)&att)[1]);
  fmc_word_program(FLASH_ZONE_B + 8, ((uint32_t *)&att)[2]);
  fmc_word_program(FLASH_ZONE_B + 12, ((uint32_t *)&att)[3]);
  fmc_word_program(FLASH_ZONE_B + 16, ((uint32_t *)&att)[4]);
  fmc_word_program(FLASH_ZONE_B + 20, ((uint32_t *)&att)[5]);
  fmc_word_program(FLASH_GYRO_BIAS, ((uint32_t *)&gyro_bias)[0]);
  fmc_word_program(FLASH_GYRO_BIAS + 4, ((uint32_t *)&gyro_bias)[1]);
  fmc_lock();

  attitude_info_t att_bak_a, att_bak_b;
  gyro_bias_t gyro_bias_bak;
  flash_read(FLASH_ZONE_A, &att_bak_a, sizeof(attitude_info_t));
  flash_read(FLASH_ZONE_B, &att_bak_b, sizeof(attitude_info_t));
  flash_read(FLASH_GYRO_BIAS, &gyro_bias_bak, sizeof(gyro_bias_t));
  // 检查写入是否成功
  if (att_bak_a.yaw_base != att.yaw_base ||
      att_bak_b.yaw_base != att.yaw_base ||
      att_bak_a.pitch_base != att.pitch_base ||
      att_bak_b.pitch_base != att.pitch_base ||
      att_bak_a.roll_base != att.roll_base ||
      att_bak_b.roll_base != att.roll_base ||
      gyro_bias_bak.gz_bias != gyro_bias.gz_bias ||
      gyro_bias_bak.temp_ref != gyro_bias.temp_ref) {
    return -1;
  } else {
    return 1;
  }
}

/**
 * @brief 上电加载安装标定零点
 */
void load_install_zero_point(void) {
  flash_read(FLASH_ZONE_A, &att, sizeof(attitude_info_t));
  flash_read(FLASH_GYRO_BIAS, &gyro_bias, sizeof(gyro_bias_t));

  if (isnan(att.pitch_base) || isnan(att.yaw_now) || att.pitch_base > 1000.0f ||
      att.pitch_base < -1000.0f) {
    att.pitch = 0.0f;
    att.roll = 0.0f;
    att.pitch_base = 0.0f;
    att.roll_base = 0.0f;
    att.yaw_base = 0.0f;
    att.yaw_now = 0.0f;
    gyro_bias.gz_bias = 0.0f;
    gyro_bias.temp_ref = 25.0f;
    // printf("Flash data invalid, using default zero point!\n");
  }
}

/************************ 报警参数Flash存储（偏转阈值/预警时间） ************************/
typedef struct {
  float roll_mild;
  float pitch_mild;
  float yaw_mild;
  float roll_severe;
  float pitch_severe;
  float yaw_severe;
  uint16_t warning_time;
  uint16_t reserved;
} alarm_config_t;

int save_alarm_config(void) {
  alarm_config_t cfg;
  alarm_config_t verify;
  uint32_t *p;
  uint8_t i;

  cfg.roll_mild = roll_mild_threshold;
  cfg.pitch_mild = pitch_mild_threshold;
  cfg.yaw_mild = yaw_mild_threshold;
  cfg.roll_severe = roll_severe_threshold;
  cfg.pitch_severe = pitch_severe_threshold;
  cfg.yaw_severe = yaw_severe_threshold;
  cfg.warning_time = alarm_warning_time;
  cfg.reserved = 0;

  fmc_unlock();
  fmc_page_erase(FLASH_ALARM_CFG);
  p = (uint32_t *)&cfg;
  for (i = 0; i < sizeof(alarm_config_t) / 4; i++) {
    fmc_word_program(FLASH_ALARM_CFG + i * 4, p[i]);
  }
  fmc_lock();

  // 读回验证
  flash_read(FLASH_ALARM_CFG, (void *)&verify, sizeof(alarm_config_t));
  if (0 != memcmp((const void *)&cfg, (const void *)&verify, sizeof(alarm_config_t))) {
    return -1;
  }
  return 1;
}

void load_alarm_config(void) {
  alarm_config_t cfg;
  flash_read(FLASH_ALARM_CFG, (void *)&cfg, sizeof(alarm_config_t));

  if (cfg.roll_mild < 1.0f || cfg.roll_mild > 45.0f ||
      cfg.pitch_mild < 1.0f || cfg.pitch_mild > 45.0f ||
      cfg.yaw_mild < 1.0f || cfg.yaw_mild > 45.0f ||
      cfg.roll_severe < cfg.roll_mild || cfg.roll_severe > 90.0f ||
      cfg.pitch_severe < cfg.pitch_mild || cfg.pitch_severe > 90.0f ||
      cfg.yaw_severe < cfg.yaw_mild || cfg.yaw_severe > 90.0f ||
      cfg.warning_time < 1 || cfg.warning_time > 3600) {
    roll_mild_threshold = 8.0f;
    pitch_mild_threshold = 15.0f;
    yaw_mild_threshold = 8.0f;
    roll_severe_threshold = 20.0f;
    pitch_severe_threshold = 25.0f;
    yaw_severe_threshold = 20.0f;
    alarm_warning_time = 180;
  } else {
    roll_mild_threshold = cfg.roll_mild;
    pitch_mild_threshold = cfg.pitch_mild;
    yaw_mild_threshold = cfg.yaw_mild;
    roll_severe_threshold = cfg.roll_severe;
    pitch_severe_threshold = cfg.pitch_severe;
    yaw_severe_threshold = cfg.yaw_severe;
    alarm_warning_time = cfg.warning_time;
  }
}

/************************ RS485串口上报函数 ************************/
/**
 * @brief 串口发送字符串
 */
void usart_send_string(char *str) {
  uint16_t len = strlen(str);
  for (uint16_t i = 0; i < len; i++) {
    while (usart_flag_get(USART_RS485, USART_FLAG_TBE) == RESET)
      ;
    usart_data_transmit(USART_RS485, str[i]);
  }
  while (usart_flag_get(USART_RS485, USART_FLAG_TC) == RESET)
    ;
}

/**
 * @brief 发送报警信息
 * @param fault_type:0x01倾斜故障 0x02旋转故障 0x03同时故障
 */
void send_alarm_info(uint8_t fault_type, float pit, float rol, float yaw) {
  static uint16_t alarm_print_cnt = 0;
  alarm_print_cnt++;
  if (alarm_print_cnt >= 100) {
    char buf[64] = {0};
    // sprintf(buf, "FAULT:%d,P=%.1f,R=%.1f,Y=%.1f\r\n", fault_type, pit, rol,
    //         yaw);
    // printf("%s", buf);
    alarm_print_cnt = 0;
  }
}

/************************ 昼夜模式切换（RTC小时判定） ************************/
void update_day_night_mode(uint8_t rtc_hour) {
  // 6点~22点白天6轴模式，其余夜间9轴融合
  if (rtc_hour >= 6 && rtc_hour < 22)
    day_mode = 1;
  else
    day_mode = 0;
}

/************************ 主循环调度函数（10ms定时调用）
 * ************************/
/**
 * @brief 定时10ms执行一次，传入RTC当前小时
 */
void imu_main_loop(uint8_t rtc_hour) {
  // 更新昼夜工作模式
  // printf("main loop\n");
  // usart_interrupt_enable(USART0, USART_INT_TBE);
  update_day_night_mode(rtc_hour);

  // 采集传感器原始数据
  icm42670_get_raw_data();
  qmc5883p_get_raw_data();
  // 检测前后地磁向量模长，参数值判断磁场是否被干扰
  mag_disturb_detect();

  // 分时姿态解算
  //   if (day_mode == 1)
  attitude_calc_6axis(-icm_raw.az, icm_raw.ay, icm_raw.ax, -icm_raw.gz,
                      icm_raw.gy, icm_raw.gx, icm_raw.temp);
  //   else
  //   attitude_calc_9axis();

